package com.edu.ulab.app.storage;

public class Storage {
    //todo создать хранилище в котором будут содержаться данные = СДЕЛАНО
    // сделать абстракции через которые можно будет производить операции с хранилищем = СДЕЛАНО
    // продумать логику поиска и сохранения = СДЕЛАНО
    // продумать возможные ошибки = СДЕЛАНО, но не всё, надо ещё время
    // учесть, что при сохранении юзера или книги, должен генерироваться идентификатор = СДЕЛАНО
    // продумать что у юзера может быть много книг и нужно создать эту связь = СДЕЛАНО, но не нравится, на подумать надо ещё время
    // так же учесть, что методы хранилища принимают другой тип данных - учесть это в абстракции = СДЕЛАНО
}
